package com.sharing.cn.api;

import com.alibaba.fastjson.JSON;
import com.alibaba.fastjson.TypeReference;
import com.sharing.cn.publicvo.juhe.JuHe;
import com.sharing.cn.publicvo.juhe.JuHeData;
import com.sharing.cn.publicvo.juhe.JuHeResult;
import com.sharing.cn.utils.DateUtils;
import com.sharing.cn.utils.http.HttpUtil;
import lombok.extern.slf4j.Slf4j;
import org.apache.http.client.methods.HttpGet;

import java.io.UnsupportedEncodingException;
import java.net.URLDecoder;
import java.net.URLEncoder;
import java.util.Date;
import java.util.List;
import java.util.Objects;

/**
 * 聚合平台笑话大全
 * @author ext.shikai1
 */
@Slf4j
public class JuHeApi {


    /**
     * 最新笑话
     */
    public static final String JOKE_URL = "http://v.juhe.cn/joke/content/text.php";
    public static final String JOKE_KEY = "35daa83ff191ebb2262aaa0691ac6599";

    /**
     * 笑话查询
     * @param page
     * @param pageSize
     * @return
     */
    public static List<JuHeResult> queryJoke(Integer page, Integer pageSize) {
        String params = JOKE_URL + "?page=" + page +
                "&pagesize=" + pageSize +
                "&key=" + JOKE_KEY;
        HttpGet get = new HttpGet(params);
        get.setHeader("Content-Type", "application/x-www-form-urlencoded");
        return Objects.requireNonNull(JSON.parseObject(HttpUtil.get(get), new TypeReference<JuHe<JuHeData>>() {
        })).getResult().getData();
    }

    /**
     * 历史上的今天
     */
    public static final String TODAY_HISTORY_URL = "http://v.juhe.cn/todayOnhistory/queryEvent.php";
    public static final String TODAY_HISTORY_KEY = "b7c70553acf521ac694292fcb6a384d2";
    /**
     * 历史上的今天
     * @param date 日期,格式:月/日 如:1/1,/10/1,12/12 如月或者日小于10,前面无需加0
     * @return
     */
    public static List<JuHeResult> queryTodayInHistory(String date) {
        String params = TODAY_HISTORY_URL + "?date=" + date +
                "&key=" + TODAY_HISTORY_KEY;
        HttpGet get = new HttpGet(params);
        get.setHeader("Content-Type", "application/x-www-form-urlencoded");
        return Objects.requireNonNull(JSON.parseObject(HttpUtil.get(get), new TypeReference<JuHe<List<JuHeResult>>>() {
        })).getResult();
    }

    /**
     * 周公解梦
     */
    public static final String CRAZY_DREAM_URL = "http://v.juhe.cn/dream/query";
    public static final String CRAZY_DREAM_KEY = "c8bc9e3df591fd4b790c29bde41c70a3";

    /**
     * 查询周公解梦类型
     * @return
     */
    public static List<JuHeResult> queryCrazyDreamChannel() {
        String s = "[{\"fid\":\"0\",\"id\":\"1\",\"name\":\"人物类\"},{\"fid\":\"0\",\"id\":\"2\",\"name\":\"其他类\"},{\"fid\":\"0\",\"id\":\"3\",\"name\":\"动物类\"},{\"fid\":\"0\",\"id\":\"4\",\"name\":\"娱乐类\"},{\"fid\":\"0\",\"id\":\"5\",\"name\":\"宗教类\"},{\"fid\":\"0\",\"id\":\"6\",\"name\":\"山水类\"},{\"fid\":\"0\",\"id\":\"7\",\"name\":\"建筑类\"},{\"fid\":\"0\",\"id\":\"8\",\"name\":\"恐怖类\"},{\"fid\":\"0\",\"id\":\"9\",\"name\":\"情爱类\"},{\"fid\":\"0\",\"id\":\"10\",\"name\":\"植物类\"},{\"fid\":\"0\",\"id\":\"11\",\"name\":\"活动类\"},{\"fid\":\"0\",\"id\":\"12\",\"name\":\"物品类\"},{\"fid\":\"0\",\"id\":\"13\",\"name\":\"生活类\"},{\"fid\":\"0\",\"id\":\"14\",\"name\":\"疾病类\"},{\"fid\":\"0\",\"id\":\"15\",\"name\":\"自然类\"},{\"fid\":\"0\",\"id\":\"16\",\"name\":\"身体类\"},{\"fid\":\"0\",\"id\":\"17\",\"name\":\"运动类\"},{\"fid\":\"0\",\"id\":\"18\",\"name\":\"食物类\"},{\"fid\":\"0\",\"id\":\"19\",\"name\":\"鬼神类\"},{\"fid\":\"3\",\"id\":\"85\",\"name\":\"哺乳类\"},{\"fid\":\"3\",\"id\":\"86\",\"name\":\"昆虫类\"},{\"fid\":\"3\",\"id\":\"87\",\"name\":\"冷血类\"},{\"fid\":\"3\",\"id\":\"88\",\"name\":\"鸟禽类\"},{\"fid\":\"3\",\"id\":\"89\",\"name\":\"其它动物\"},{\"fid\":\"19\",\"id\":\"90\",\"name\":\"鬼怪类\"},{\"fid\":\"19\",\"id\":\"91\",\"name\":\"其它鬼神\"},{\"fid\":\"19\",\"id\":\"92\",\"name\":\"神仙类\"},{\"fid\":\"11\",\"id\":\"93\",\"name\":\"动作类\"},{\"fid\":\"11\",\"id\":\"94\",\"name\":\"工作学习\"},{\"fid\":\"11\",\"id\":\"95\",\"name\":\"劳动类\"},{\"fid\":\"11\",\"id\":\"96\",\"name\":\"其它活动\"},{\"fid\":\"11\",\"id\":\"97\",\"name\":\"日常类\"},{\"fid\":\"14\",\"id\":\"98\",\"name\":\"医疗疾病\"},{\"fid\":\"7\",\"id\":\"99\",\"name\":\"场所类\"},{\"fid\":\"7\",\"id\":\"100\",\"name\":\"建筑类\"},{\"fid\":\"8\",\"id\":\"101\",\"name\":\"灾难罪恶\"},{\"fid\":\"2\",\"id\":\"102\",\"name\":\"其它\"},{\"fid\":\"2\",\"id\":\"103\",\"name\":\"时间节日\"},{\"fid\":\"2\",\"id\":\"104\",\"name\":\"数字形状\"},{\"fid\":\"2\",\"id\":\"105\",\"name\":\"颜色气味\"},{\"fid\":\"9\",\"id\":\"106\",\"name\":\"婚恋情感\"},{\"fid\":\"1\",\"id\":\"107\",\"name\":\"人物称谓\"},{\"fid\":\"6\",\"id\":\"108\",\"name\":\"地理环境\"},{\"fid\":\"16\",\"id\":\"109\",\"name\":\"身体器官\"},{\"fid\":\"13\",\"id\":\"110\",\"name\":\"感觉表情\"},{\"fid\":\"13\",\"id\":\"111\",\"name\":\"其它生活\"},{\"fid\":\"13\",\"id\":\"112\",\"name\":\"衣食住行\"},{\"fid\":\"18\",\"id\":\"113\",\"name\":\"食品饮料\"},{\"fid\":\"12\",\"id\":\"114\",\"name\":\"财物宝石\"},{\"fid\":\"12\",\"id\":\"115\",\"name\":\"服装饰品\"},{\"fid\":\"12\",\"id\":\"116\",\"name\":\"机械电器\"},{\"fid\":\"12\",\"id\":\"117\",\"name\":\"交通运输\"},{\"fid\":\"12\",\"id\":\"118\",\"name\":\"其它物品\"},{\"fid\":\"12\",\"id\":\"119\",\"name\":\"生活用品\"},{\"fid\":\"12\",\"id\":\"120\",\"name\":\"文化用品\"},{\"fid\":\"12\",\"id\":\"121\",\"name\":\"武器化学\"},{\"fid\":\"12\",\"id\":\"122\",\"name\":\"音乐舞蹈\"},{\"fid\":\"4\",\"id\":\"123\",\"name\":\"娱乐类\"},{\"fid\":\"17\",\"id\":\"124\",\"name\":\"运动类\"},{\"fid\":\"10\",\"id\":\"125\",\"name\":\"豆类\"},{\"fid\":\"10\",\"id\":\"126\",\"name\":\"瓜类\"},{\"fid\":\"10\",\"id\":\"127\",\"name\":\"果实\"},{\"fid\":\"10\",\"id\":\"128\",\"name\":\"花草\"},{\"fid\":\"10\",\"id\":\"129\",\"name\":\"粮食\"},{\"fid\":\"10\",\"id\":\"130\",\"name\":\"其它植物\"},{\"fid\":\"10\",\"id\":\"131\",\"name\":\"蔬菜\"},{\"fid\":\"10\",\"id\":\"132\",\"name\":\"树类\"},{\"fid\":\"15\",\"id\":\"133\",\"name\":\"自然现象\"},{\"fid\":\"5\",\"id\":\"134\",\"name\":\"宗教类\"}]";
        return JSON.parseObject(s, new TypeReference<List<JuHeResult>>(){});
    }

    /**
     * 解梦查询
     * @param date
     * @return
     */
    public static List<JuHeResult> queryDream(String date, String cId) {
        try {
            date = URLEncoder.encode(date, "UTF-8");
        } catch (UnsupportedEncodingException e) {
            e.printStackTrace();
            return null;
        }
        String params = CRAZY_DREAM_URL + "?q=" + date +
                "&cid=" + cId + "&full=1" +
                "&key=" + CRAZY_DREAM_KEY;
        HttpGet get = new HttpGet(params);
        get.setHeader("Content-Type", "application/x-www-form-urlencoded");
        return Objects.requireNonNull(JSON.parseObject(HttpUtil.get(get), new TypeReference<JuHe<List<JuHeResult>>>() {
        })).getResult();
    }

    public static void main(String[] args) {
        //String s = queryJoke(1,20);
        //String s = "{\"reason\":\"Success\",\"result\":{\"data\":[{\"content\":\"&nbsp; &nbsp; 小区门口修车师傅生意特好。人实在,只要不换零件，常常不收钱或只收个块把钱辛苦钱。最近发现他心黑了，价钱明显上调,就连充个气也收1块钱。旁边书报亭大妈是知情人，: 唉，多担待一下吧！他家上个月二胎,一窝生了四个带把的。。。。\",\"hashId\":\"2e010657b420dcee335c870bf9a18301\",\"unixtime\":1559789702,\"updatetime\":\"2019-06-06 10:55:02\"},{\"content\":\"前天和同事去逛超市，说好久没买肉吃了，于是去看猪肉，结果看到的最便宜的猪肉都要十八块多，同事当场惊呼：“猪怎么了，这是！”卖肉的师傅笑着说：“猪没事，就是涨价了。”\",\"hashId\":\"d261d1f0d76bdc665d80f104cf7a7d65\",\"unixtime\":1556845202,\"updatetime\":\"2019-05-03 09:00:02\"},{\"content\":\"去小卖部买烟，10块钱一盒的，给老板100，老板喜咪咪的看着我说：“我没零钱找你，就让我闺女陪你一晚抵账得了。”我一激动：“你老别介啊，我攒个私房钱出来偷偷买烟，真的很不容易啊！”老板：“怎么，你不愿意？要不然我去把我闺女叫出来！”我：“别！别！这钱你不用找了，千万别让您闺女知道我藏私房钱啊！”老板：“好女婿，只要你经常来买东西，我保证不说！哈哈哈”\",\"hashId\":\"7d6e3f6cda682c18c3bc122a767b8756\",\"unixtime\":1556845202,\"updatetime\":\"2019-05-03 09:00:02\"},{\"content\":\"昨天路过单位餐厅门口的金鱼池，正好看到一条小金鱼蹦到外边了，还在张嘴，就捡起来扔到池子里。回到家跟老婆聊天时随口说起，老婆抱怨着说，“我说你个缺心眼的，怎么不去向它要幢别墅呢！”\",\"hashId\":\"7b84e9cab822da15823a98fce795f024\",\"unixtime\":1554958624,\"updatetime\":\"2019-04-11 12:57:04\"},{\"content\":\"刚才在QQ上有个还在上大学的姑娘突然跟我讲：“朋友介绍我去打工，今天晚上要到一个酒吧领舞，现在有点不敢去。”我：“有什么不敢去的？”姑娘：“刚才在小摊上只吃了碗牛肉面，怕到时候饿。”──姑娘，你心太宽了！\",\"hashId\":\"4f3822c322b649ee69f031b5a25fd4b4\",\"unixtime\":1554958624,\"updatetime\":\"2019-04-11 12:57:04\"},{\"content\":\"为什么古装剧里总是有女人会对恩人说：小女子无以为报，唯有以身相许，古代真的存在这种现象吗？ 扯淡，那是因为她喜欢他，要是不喜欢，她就会说：小女子无以为报，唯有来生再报了。\",\"hashId\":\"426c58b9639768df62f699963ce00983\",\"unixtime\":1554778627,\"updatetime\":\"2019-04-09 10:57:07\"},{\"content\":\"70年代时，有一长辈练铁沙掌，功夫成了之后，可以掌断五砖，凌空碎砖，威风的不得了。 到80年代，只能掌断三砖。 到90年代只能一砖一砖的断了。 他说，一直以为功力退步了，后来才知道烧砖的配方改了。。。\",\"hashId\":\"306049405800a610510ef5b49dced063\",\"unixtime\":1554778627,\"updatetime\":\"2019-04-09 10:57:07\"},{\"content\":\"网上聊了一妹子，今天见面。问老妈要了二百块钱，老妈问我干嘛用，我说约会，她高高兴兴的就给了。刚出家门，老爸就把我拽到一边说“小子，二百块钱给我一百，半个月不知道烟的滋味了。”我说“爸，这是我和女朋友的约会钱，不能给你。”老爸说了。“你约什么会，那是我刚建的小号，为了抽颗烟我和你聊了半个月了，快拿来。‘’\",\"hashId\":\"64e3f5a3b59aab3fd6137f7ea7a650bb\",\"unixtime\":1554778627,\"updatetime\":\"2019-04-09 10:57:07\"},{\"content\":\"家长对孩子的教育真的非常重要。有些男孩，小时候调皮的很，偷了邻居家一根针，家长也不管，一根针嘛，没事。结果孩子长大了，不好好学习每天呆在家里刺十字绣。\",\"hashId\":\"f1b0033173b42ad707449578ebefe084\",\"unixtime\":1554778627,\"updatetime\":\"2019-04-09 10:57:07\"},{\"content\":\"一女人问大师：大师，在这么复杂险恶的世界，我一个弱女子如何保护自己？大师说：你把妆卸了！\",\"hashId\":\"1668a9f0654b3af111ebabdfb88feacf\",\"unixtime\":1554778627,\"updatetime\":\"2019-04-09 10:57:07\"},{\"content\":\"楼主大四女生，这几天和同一宿舍的女生一起去找工作，在火车站，碰到一个大姐，带着一个四五岁的小男孩侯车，小男孩总是粘着我，要坐我腿上，同宿舍的女生很是羡慕我有人缘，我得意的问小男孩：“你为什么老是喜欢坐姐姐腿上？” 小男孩用稚嫩的口气回答：“姐姐腿上肉多，坐着舒服” 我：“尼玛，这是谁家小哔崽子，快点领走！”\",\"hashId\":\"8d914207de87e464bc99055a02160d27\",\"unixtime\":1554778627,\"updatetime\":\"2019-04-09 10:57:07\"},{\"content\":\"女：“我购物车里的那些水果牛奶饮料零食你赶紧给我买！” 男：“着什么急呀？” 女：“天越来越热了，会放坏的。”\",\"hashId\":\"7236a1fe92605a8b5540c4279bd8f973\",\"unixtime\":1554778627,\"updatetime\":\"2019-04-09 10:57:07\"},{\"content\":\"朋友问我：有一种鸟，好笑又神经，它是什么鸟？我：我不知道。。沙雕！\",\"hashId\":\"ef96e378ef21de4e38056b28d9e3dbe8\",\"unixtime\":1554688803,\"updatetime\":\"2019-04-08 10:00:03\"},{\"content\":\"昨天在家看抗日神剧，我问六岁的小侄女：“宝宝，你知道为什么曰本人头盔两耳边有两块布么？” 她不假思索的瞟了我一眼：“叔叔你真笨，他们设计这两块布肯定是防止被长官打耳光的！” 我。。。\",\"hashId\":\"4c57f4f968e3c169149d7e86da5e36b3\",\"unixtime\":1554688803,\"updatetime\":\"2019-04-08 10:00:03\"},{\"content\":\"昨天哥哥和嫂子有事出门，把小侄子留给我了，我带他去街上，非要拉着我给他买玩具，我给他说：“姑姑兜里没带钱。” 小侄子从自己兜里掏出三百块钱说：“就知道你小气，花我的钱。” 我俩去玩具店，给侄子买了好多玩具，又去吃了顿饭，三百块终于造完了。 摸着肚子问侄子：“这钱是你妈留给你的吗？” 侄子摸摸头说：“不是啊！来的时候趁你不注意，在你包里拿的。”\",\"hashId\":\"26c80f07d746ca16261079ba2ed412d1\",\"unixtime\":1554688803,\"updatetime\":\"2019-04-08 10:00:03\"},{\"content\":\"今天不巧看见前女友，更不巧的是我俩都穿的以前买的情侣装。。。 我寻思见面总得打个招呼吧，就贱贱的过去了，本想说“好巧啊，咱俩竟还能然穿情侣装”，没想到被她抢先一句“呦～还有跟老娘穿亲子装的！” 。。。\",\"hashId\":\"548aae5b3b2630ee8353c1cc13741265\",\"unixtime\":1554688803,\"updatetime\":\"2019-04-08 10:00:03\"},{\"content\":\"今天坐高铁回家注意到身边一名男子，他穿得干净、得体，脸庞留下少许岁月痕迹。 他忧郁的眼神，时而静静望窗外，像是思考过往人生；时而双眼微闭，让疲倦的身体有片刻歇息。 根据个人多年行为模式研究、心理学观察及社会经验判断——――这人十有八九是手机没电了。\",\"hashId\":\"f812b44e0fc9c87278ae74d325c4b207\",\"unixtime\":1554688803,\"updatetime\":\"2019-04-08 10:00:03\"},{\"content\":\"家里大拜祖先。小明不拜，说：“拜祖先有什么用，祖先又不会保佑的！”爸爸：“你个死孩子，不要乱说！”小明：“谁乱说了啊。”他指着供桌上的猪头：“要是祖先会保佑的话，这猪的祖先天蓬元帅怎么会让自己的后辈子孙给人宰了当祭品。”\",\"hashId\":\"822796875b1503824bb55bbce022d4df\",\"unixtime\":1554688803,\"updatetime\":\"2019-04-08 10:00:03\"},{\"content\":\"三毛去发型屋做发型，对发型师说：给我编个麻花辫。发型师不小心弄掉了三毛的一根头发。三毛叹口气说：那来个中分好拉。可是发型师不小心又弄掉了根。三毛一看火了：你丫的想让我披头散发？\",\"hashId\":\"64840fad250dc560a309537256d9b6d7\",\"unixtime\":1554688803,\"updatetime\":\"2019-04-08 10:00:03\"},{\"content\":\"酒吧里，一个大汉侃侃而谈：“我们出来 混社团，最重要的就是信用二字！”旁边 几个小年轻赶紧上前，崇拜的为他点了 一支烟问：“哥，不知您混的哪个社 团？”大汉吸了口烟，眯着眼睛答道：“铁 岭农村信用社。”\",\"hashId\":\"dcb79fee2ff3153d36377afed622311c\",\"unixtime\":1554688803,\"updatetime\":\"2019-04-08 10:00:03\"}]},\"error_code\":0}\n";
        //JuHe<JuHeData> joke = JSON.parseObject(s, new TypeReference<JuHe<JuHeData>>(){});
        //System.out.println(JSON.toJSONString(joke.getResult().getData()));

        //String s = "{\"reason\":\"success\",\"result\":[{\"day\":\"1\\/16\",\"date\":\"-27年1月16日\",\"title\":\"罗马帝国建立\",\"e_id\":\"739\"},{\"day\":\"1\\/16\",\"date\":\"881年1月16日\",\"title\":\"黄巢即皇帝位\",\"e_id\":\"740\"},{\"day\":\"1\\/16\",\"date\":\"972年1月16日\",\"title\":\"辽朝及契丹皇帝辽圣宗耶律隆绪诞生\",\"e_id\":\"741\"},{\"day\":\"1\\/16\",\"date\":\"1517年1月16日\",\"title\":\"缅甸东吁王朝国王莽应龙出生\",\"e_id\":\"742\"},{\"day\":\"1\\/16\",\"date\":\"1581年1月16日\",\"title\":\"英国议会驱逐天主教徒\",\"e_id\":\"743\"},{\"day\":\"1\\/16\",\"date\":\"1605年1月16日\",\"title\":\"《唐吉诃德》首次出版\",\"e_id\":\"744\"},{\"day\":\"1\\/16\",\"date\":\"1765年1月16日\",\"title\":\"马铃薯暴动\",\"e_id\":\"745\"},{\"day\":\"1\\/16\",\"date\":\"1794年1月16日\",\"title\":\"英国史学家爱德华·吉本逝世\",\"e_id\":\"746\"},{\"day\":\"1\\/16\",\"date\":\"1882年1月16日\",\"title\":\"《申报》首用国内电讯\",\"e_id\":\"747\"},{\"day\":\"1\\/16\",\"date\":\"1882年1月16日\",\"title\":\"南洋传奇巨子万金油大王胡文虎出生\",\"e_id\":\"748\"},{\"day\":\"1\\/16\",\"date\":\"1885年1月16日\",\"title\":\"散文家周作人诞辰\",\"e_id\":\"749\"},{\"day\":\"1\\/16\",\"date\":\"1900年1月16日\",\"title\":\"英国放弃对萨摩亚岛的主权\",\"e_id\":\"750\"},{\"day\":\"1\\/16\",\"date\":\"1901年1月16日\",\"title\":\"古巴独裁者、总统巴蒂斯塔·伊·萨尔迪瓦出生\",\"e_id\":\"751\"},{\"day\":\"1\\/16\",\"date\":\"1901年1月16日\",\"title\":\"瑞士象征主义画家阿诺德•勃克林逝世\",\"e_id\":\"752\"},{\"day\":\"1\\/16\",\"date\":\"1906年1月16日\",\"title\":\"无线电发明家波波夫逝世\",\"e_id\":\"753\"},{\"day\":\"1\\/16\",\"date\":\"1908年1月16日\",\"title\":\"党和国家的优秀领导人陶铸诞辰\",\"e_id\":\"754\"},{\"day\":\"1\\/16\",\"date\":\"1908年1月16日\",\"title\":\"百老汇音乐剧舞台伟大女演员艾索尔·摩曼出生\",\"e_id\":\"755\"},{\"day\":\"1\\/16\",\"date\":\"1916年1月16日\",\"title\":\"蔡锷率护国军讨伐袁世凯\",\"e_id\":\"756\"},{\"day\":\"1\\/16\",\"date\":\"1920年1月16日\",\"title\":\"协约国要求引渡德皇威廉二世，遭荷兰拒绝\",\"e_id\":\"757\"},{\"day\":\"1\\/16\",\"date\":\"1920年1月16日\",\"title\":\"中国著名诗人，散文家、小说家魏巍出生\",\"e_id\":\"758\"},{\"day\":\"1\\/16\",\"date\":\"1923年1月16日\",\"title\":\"孙中山夺回广州，发表和平统一宣言\",\"e_id\":\"759\"},{\"day\":\"1\\/16\",\"date\":\"1929年1月16日\",\"title\":\"招商局新华轮在距香港10海里处触礁三百余人遇难\",\"e_id\":\"760\"},{\"day\":\"1\\/16\",\"date\":\"1934年1月16日\",\"title\":\"蒋介石占领福州，十九路军兵败降蒋\",\"e_id\":\"761\"},{\"day\":\"1\\/16\",\"date\":\"1936年1月16日\",\"title\":\"丹麦物理学家玻尔抵达纽约\",\"e_id\":\"762\"},{\"day\":\"1\\/16\",\"date\":\"1936年1月16日\",\"title\":\"美国连环杀手亚伯特费雪被处电死\",\"e_id\":\"763\"},{\"day\":\"1\\/16\",\"date\":\"1940年1月16日\",\"title\":\"希特勒取消原定的西线进攻计划\",\"e_id\":\"764\"},{\"day\":\"1\\/16\",\"date\":\"1942年1月16日\",\"title\":\"尼赫鲁接替甘地成为国大党领袖\",\"e_id\":\"765\"},{\"day\":\"1\\/16\",\"date\":\"1944年1月16日\",\"title\":\"美国的艾森豪威尔将军被任命为盟军总司令\",\"e_id\":\"766\"},{\"day\":\"1\\/16\",\"date\":\"1945年1月16日\",\"title\":\"法国将雷诺汽车公司国有化\",\"e_id\":\"767\"},{\"day\":\"1\\/16\",\"date\":\"1949年1月16日\",\"title\":\"北平和平解放\",\"e_id\":\"768\"},{\"day\":\"1\\/16\",\"date\":\"1966年1月16日\",\"title\":\"NBA公牛队在芝加哥成立\",\"e_id\":\"769\"},{\"day\":\"1\\/16\",\"date\":\"1969年1月16日\",\"title\":\"苏联两艘宇宙飞船第一次完成空中对接\",\"e_id\":\"770\"},{\"day\":\"1\\/16\",\"date\":\"1970年1月16日\",\"title\":\"穆阿马·卡扎菲上校成为利比亚总理\",\"e_id\":\"771\"},{\"day\":\"1\\/16\",\"date\":\"1975年1月16日\",\"title\":\"葡萄牙同意安哥拉独立\",\"e_id\":\"772\"},{\"day\":\"1\\/16\",\"date\":\"1979年1月16日\",\"title\":\"伊朗巴列维王朝被推翻\",\"e_id\":\"773\"},{\"day\":\"1\\/16\",\"date\":\"1980年1月16日\",\"title\":\"邓小平提出80年代抓好三件事\",\"e_id\":\"774\"},{\"day\":\"1\\/16\",\"date\":\"1981年1月16日\",\"title\":\"我国第一座原子反应堆改建成功\",\"e_id\":\"775\"},{\"day\":\"1\\/16\",\"date\":\"1981年1月16日\",\"title\":\"中国政府决定发行国库券\",\"e_id\":\"776\"},{\"day\":\"1\\/16\",\"date\":\"1981年1月16日\",\"title\":\"世界最大的巡洋战舰“基洛夫号”试航\",\"e_id\":\"777\"},{\"day\":\"1\\/16\",\"date\":\"1982年1月16日\",\"title\":\"梵蒂冈与英国恢复终止450年的关系\",\"e_id\":\"778\"},{\"day\":\"1\\/16\",\"date\":\"1983年1月16日\",\"title\":\"中国第一个冷冻精液人工授精孕育的婴儿诞生\",\"e_id\":\"779\"},{\"day\":\"1\\/16\",\"date\":\"1984年1月16日\",\"title\":\"第4次伊斯兰国家首脑议会在摩洛哥的卡萨布兰卡举行\",\"e_id\":\"780\"},{\"day\":\"1\\/16\",\"date\":\"1985年1月16日\",\"title\":\"我国第一座海水淡化工程在西沙群岛永兴岛建成投产\",\"e_id\":\"781\"},{\"day\":\"1\\/16\",\"date\":\"1986年1月16日\",\"title\":\"中国现代著名出版家胡愈之在北京逝世\",\"e_id\":\"782\"},{\"day\":\"1\\/16\",\"date\":\"1986年1月16日\",\"title\":\"科学发现钡镧铜氧化物超导现象\",\"e_id\":\"783\"},{\"day\":\"1\\/16\",\"date\":\"1987年1月16日\",\"title\":\"胡耀邦辞去中共中央总书记职务\",\"e_id\":\"784\"},{\"day\":\"1\\/16\",\"date\":\"1988年1月16日\",\"title\":\"上海流行甲肝\",\"e_id\":\"785\"},{\"day\":\"1\\/16\",\"date\":\"1993年1月16日\",\"title\":\"江西九江长江大桥建成\",\"e_id\":\"786\"},{\"day\":\"1\\/16\",\"date\":\"1995年1月16日\",\"title\":\"中国与摩纳哥建交\",\"e_id\":\"787\"},{\"day\":\"1\\/16\",\"date\":\"1997年1月16日\",\"title\":\"国家电力公司组建成立\",\"e_id\":\"788\"},{\"day\":\"1\\/16\",\"date\":\"2001年1月16日\",\"title\":\"刚果民主共和国国家元首遇刺\",\"e_id\":\"789\"},{\"day\":\"1\\/16\",\"date\":\"2006年1月16日\",\"title\":\"利比里亚新当选总统成为非洲历史上第一位民选女总统\",\"e_id\":\"790\"},{\"day\":\"1\\/16\",\"date\":\"2006年1月16日\",\"title\":\"蒙古族男子以2.36米身高成世界健在第一巨人\",\"e_id\":\"791\"},{\"day\":\"1\\/16\",\"date\":\"2007年1月16日\",\"title\":\"斯里兰卡一辆公共汽车当天早晨在斯东南部地区发生爆炸\",\"e_id\":\"792\"},{\"day\":\"1\\/16\",\"date\":\"2009年1月16日\",\"title\":\"《喜羊羊与灰太狼之牛气冲天》上映\",\"e_id\":\"793\"},{\"day\":\"1\\/16\",\"date\":\"2011年1月16日\",\"title\":\"北京大学连续四年夺冠中国大学排行榜\",\"e_id\":\"794\"},{\"day\":\"1\\/16\",\"date\":\"2015年1月16日\",\"title\":\"国家安全部原副部长马建被查\",\"e_id\":\"795\"},{\"day\":\"1\\/16\",\"date\":\"2016年1月16日\",\"title\":\"蔡英文当选台湾地区首位女领导人\",\"e_id\":\"796\"},{\"day\":\"1\\/16\",\"date\":\"2018年1月16日\",\"title\":\"开国少将刘中华逝世\",\"e_id\":\"797\"},{\"day\":\"1\\/16\",\"date\":\"2020年1月16日\",\"title\":\"我国著名主持人赵忠祥在京病逝\",\"e_id\":\"798\"},{\"day\":\"1\\/16\",\"date\":\"2020年1月16日\",\"title\":\"中国首颗10Gbps低轨宽带卫星上天\",\"e_id\":\"799\"}],\"error_code\":0}\n";
        //String s = queryTodayInHistory(DateUtils.date2Str(new Date(), DateUtils.PATTERN_MMDD1));
        //JuHe<List<JuHeResult>> joke = JSON.parseObject(s, new TypeReference<JuHe<List<JuHeResult>>>(){});
        //System.out.println(JSON.toJSONString(joke));

        List<JuHeResult> dream = queryDream("梦", null);
        System.out.println(JSON.toJSONString(dream));
    }

}
